library(leaflet)

lng = c( -71.168346,  -0.127696,-73.480052, -122.6, -79.256992, 
         -110.676458,-79.870254, -74.001713, -79.643555, -64.782294)

lat = c(46.798941, 51.507351, 45.525560, 49.216667, 43.875400, 50.039968,  
        43.516398, 45.663616, 43.588424, 46.086599)

municipality = c("Lévis", "London", "Longueuil", 
                 "Maple Ridge", "Markham", "Medicine Hat", 
                 "Milton", "Mirabel", "Mississauga", "Moncton")

province = c("Quebec", "Ontario", "Quebec", "British Columbia", "Ontario", 
             "Alberta", "Ontario", "Quebec", "Ontario", "New Brunswick")

status = c("Ville", "City", "Ville", "City", "City", "City", 
           "Town", "City", 	"City", "City")

area = c(448.07, 420.5, 115.77, 267.82, 210.93, 111.97, 363.83, 484.09, 292.74,
         140.67)

pop_96 = c(129726, 7460385,  243262, 35931, 159832, 53043, 32104, 22689,
           544382, 59313)

pop_01 = c(135824, 7559922 , 250996, 40810, 182511, 54491, 31471, 27315,
           612925, 61046)

pop_06 = c(143923, 7971941, 261695, 44282, 206774, 56142, 53939, 34626,
           668549, 64128)

pop_11 = c(152088, 8173941, 274621, 48610, 238524, 57252, 84362, 41957,
           713443, 69074)

pop_16 = c(161408, 8675454, 288783, 52793, 276303, 60509, 110128, 50513, 
           721599, 71889)

datainsert = data.frame(lng, lat, municipality, province, status, area,
                        pop_96, pop_01, pop_06, pop_11, pop_16)


leaflet() %>% 
  addTiles() %>%
  addCircleMarkers(data = datainsert, lng = ~lng, lat = ~lat,
                   radius = 5, color = "green",
                   popup = ~paste0("<b>","Долгота: ","</b>",lng, "<br>",
                                   "<b>","Широта: ","</b>",lat, "<br>",
                                   "<b>","Название города: ","</b>", municipality,"<br>",
                                   "<b>","Провинция: ","</b>", province,"<br>", 
                                   "<b>","Статус: ","</b>", status, "<br>",
                                   "<b>","Площадь: ","</b>", area," км.^2" , "<br>",
                                   "<b>",pop_96,"</b>", " - Численность населения на 1996 год.", "<br>",
                                   "<b>",pop_01,"</b>", " - Численность населения на 2001 год.", "<br>",
                                   "<b>",pop_06,"</b>", " - Численность населения на 2006 год.", "<br>",
                                   "<b>",pop_11,"</b>", " - Численность населения на 2011 год.",  "<br>",
                                   "<b>",pop_16,"</b>", " - Численность населения на 2016 год." ))